{
  "registerYourSystems": "Register your systems with Red Hat Insights",
  "preinstallationChecks": "Preinstallation checks",
  "systemsManaged": "How are the systems managed?",
  "viewInsightsDashboard": "View Insights dashboard",
  "installTheClient": "Install the client and register your systems to Red Hat Insights",
  "rhel8": "RHEL 8",
  "rhel76": "RHEL 7 & 6",
  "downloadPuppet": "Download the Insights-client puppet module",
  "downloadModule": "Download module",
  "installAndConfigure": "Install and configure your puppet module",
  "automatedInstallation": "Automated Installation",
  "manualInstall": "Manual Installation",
  "puppetAutomatedInstall": "If you are using Red Hat Satellite's configuration management provided by puppet this process can be automated by applying the preinstalled Puppet class {class}. This class can be imported from the Puppet Master into t he appropriate Puppet enviroment and papplied to hots that you wish to subrscribe to Red Hat Insights.",
  "puppetAutomatedInstallMoInfo": "For more information on this topic, refer to the Creating a Host Group chapter in the official Satellite 6 User Guide.",
  "deployingRHInsights": "Deploying Red Hat Insights using the Ansible Role included with your Smart Management entitlement",
  "youCanAutomate": "You can automate the installation and registration of hosts with Red Hat Insights using the {role} Ansible role. For more information about adding this role to your Satellite, see {link}.",
  "managingAnsibleRoles": "Managing Ansible Roles",
  "hostGroup": "Host Group chapter",
  "rhSupported": "Red Hat-supported versions",
  "operatingSystem": "Operating System",
  "operatingSystemNote": "Note: Red Hat Insights can be used on all {rhSupported} of Red Hat Enterprise Linux, version 6.4 and later.",
  "stepOneTitle": "Step 1: Tell us about your systems",
  "deployRHI": "Deploy Red Hat Insights using Puppet in Satellite",
  "stepNumberTitle": "Step {number}: {variable}",
  "rhsChooseConfigMan": "Choose a configuration management tool",
  "rhsChooseConfig": "Note: you can automate the installation and registration of systems with Ansible, included with your Red Hat Enterprise Linux entitlement.",
  "rhsChooseConfigStepOne": "Add the RedHatInsights.insights-client role to the hosts. {newLine}\n        For new hosts, see {linkOne}. {newLine}\n        For existing hosts, see {linkTwo}.",
  "rhsChooseConfigStepTwo": "To run the RedHatInsights.insights-client role on your host, navigate to Hosts > All Hosts and click the name of the host that you want to use.",
  "rhsChooseConfigStepThree": "Click the Run Ansible roles button.",
  "rhsChooseConfigStepFour": "See host on the Insights > Overview page of the Satellite web UI",
  "sectionTwo": "Section 2.1, \"Creating a Host in Red Hat Satellite\"",
  "chapterEight": "Chapter 8, Using Ansible Roles",
  "toApply": "To apply any system updates to the Red Hat Insights plug-in, enter httpd restart after updating.",
  "toView": "To view the logs for Red Hat Insights and all plug-ins, go to /var/log/foreman/production.log.",
  "ifYouHaveProblems": "If you have problems connecting to Red Hat Insights, ensure that your certificates are up-to-date. Refresh your subscription manifest to update your certificates.",
  "youCanChange": "You can change the default schedule for running insights-client by configuring insights-client.timer on a host. For more information, see {link} in the Client Configuration Guide for Red Hat Insights.",
  "changingTheInsights": "Changing the insights-client schedule",
  "rhsm": "Red Hat Subscription Manager",
  "registerRhsm": "Register with RHSM",
  "registerRhsmText": "You must register all Red Hat Enterprise Linux (RHEL) systems with Red Hat Subscription Manager to recieve necessary updates and to resolve software dependencies.",
  "registerRhsmTextNote": "Note: If the system cannot be subscribed to RHSM, {basicAuth} can be configured on the client.",
  "registerRhsmTextNoteAfter": "If you have a web-based proxy between your system and the Internet, you can configure the insights-client to connect through it. For more information, refer to {howToAccess}.",
  "basicAuth": "basic authentication",
  "howToAccess": "How to access Red Hat Insights through a firewall/Proxy",
  "rhs": "Red Hat Satellite",
  "publicCloud": "Public cloud/RHUI",
  "enablingInsightsOnRhuiTitle": "Enabling Insights on RHUI/Cloud marketplace",
  "enablingInsightsOnRhuiParagraph1": "You must have a Red Hat account.  If you've used RHEL on-demand through a public cloud marketplace but have never interacted with Red Hat directly, you can create an account by {createRedHatAccountInstructions}.",
  "enablingInsightsOnRhuiParagraph2": "If you're using a Red Hat subscription to entitle your RHEL system, you must enable the subscription for Red Hat Cloud Access.  Learn how to in the {cloudAccessDocumentation}.",
  "createRedHatAccountInstructions": "following these instructions",
  "cloudAccessDocumentation": "Cloud Access documentation",
  "deployInsightsOnCloudTitle": "Deploy Red Hat Insights on your cloud infrastructure",
  "deployInsightsOnCloudText": "The following guidance is user who wish to deploy Red Hat Insights on an existing, cloud marketplace-purchased Red Hat Enterprise Linux (RHEL) system managed by Red Hat Update Infrastructure (RHUI).  This include on-demand, hourly systems purchased from CCSP marketplace, as well as systems deployed from Red Hat Gold Images in AWS.  This procedure involves the following tasks:",
  "installInsightsClient": "Install the Insights client on each system",
  "registerInsightsClient": "Register the system to Insights",
  "configureBasicAuthTitle": "Configure basic authentication in /etc/insights-client/insights-client.conf",
  "configureBasicAuthStep1": "Modify the auto_config= value to FALSE",
  "configureBasicAuthStep2": "Add your Red Hat SSO username to username",
  "configureBasicAuthStep3": "Add your Red Hat SSO password to password",
  "configureBasicAuthStep4": "Save the configuration",
  "visitOurDocumentation": "visit our documentation",
  "insightsWithBasicAuthNote": "Note: To read more about using Red Hat Insights with basic authentication and recommended best practices, {visitOurDocumentation}.",
  "dataCollection": "Data collection & controls",
  "learnMore": "Learn more",
  "setupConfigure": "Setup and Configure",
  "assessAndMonitor": "Assess and monitor the compliance of your RHEL systems using Policies",
  "detectAndNotify": "Detect and be notified of system configuration changes using Custom Policies",
  "rhSM": "Red Hat® Smart Management",
  "combineTheFlexible": "Combines the flexible and powerful infrastructure management capabilities of Red Hat Satellite with the ability to execute remediation plans from Red Hat Insights",
  "subscribeSatellite": "Subscribe hosts to the Satellite server",
  "subscribeSatelliteBody": "This step is typically already performed as par of Satellite host configuration.  Only RHEL hosts registered to the particular Satellite server will have reports available in the Satellite UI.",
  "verifySatellite": "Verify Satellite server connection to Red Hat Insights",
  "verifySatelliteStepOne": "In the Satellite UI, navigate to Insighst > Manage.",
  "verifySatelliteStepTwo": "Verify under Insights Engine Connection that the status is Connected and the Account Number field displays the correct information for your organization.",
  "verifySatelliteNote": "Satellite organization with Red Hat Insights must be operating in Connected mode. Any firewalls or proxies through which the Satellite server communicates to Red Hat must allow https communications to {link}.",
  "useAutomation": "Do you wish to use automation for installation?",
  "automationNote": "Note: You can automate the installation and registration of systems with Ansible, included with your Red Hat Enterprise Linux entitlement.",
  "ansible": "Ansible",
  "puppet": "Puppet",
  "no": "No",
  "additionalInfo": "Additional Information"
}
