{
  "registerYourSystems": "Register your systems with Red Hat Insights",
  "preinstallationChecks": "Preinstallation checks",
  "systemsManaged": "How are the systems managed?",
  "viewInsightsDashboard": "View Insights dashboard",
  "installTheClient": "Install the client and register your systems to Red Hat Insights",
  "rhel8": "RHEL 8",
  "rhel76": "RHEL 7 & 6",
  "downloadPuppet": "Download the Insights-client puppet module",
  "downloadModule": "Download module",
  "installAndConfigure": "Install and configure your puppet module",
  "automatedInstallation": "Automated Installation",
  "manualInstall": "Manual Installation",
  "puppetAutomatedInstall": "If you are using Red Hat Satellite's configuration management provided by puppet this process can be automated by applying the preinstalled Puppet class {class}. This class can be imported from the Puppet Master into t he appropriate Puppet enviroment and papplied to hots that you wish to subrscribe to Red Hat Insights.",
  "puppetAutomatedInstallMoInfo": "For more information on this topic, refer to the Creating a Host Group chapter in the official Satellite 6 User Guide.",
  "hostGroup": "Host Group chapter",
  "rhSupported": "Red Hat-supported versions",
  "operatingSystem": "Operating System",
  "operatingSystemNote": "Note: Red Hat Insights can be used on all {rhSupported} of Red Hat Enterprise Linux, version 6.4 and later.",
  "stepOneTitle": "Step 1: Tell us about your systems",
  "deployRHI": "Deploy Red Hat Insights using Puppet in Satellite",
  "stepNumberTitle": "Step {number}: {variable}",
  "rhsChooseConfigMan": "Choose a configuration management tool",
  "rhsChooseConfig": "Note: you can automate the installation and registration of systems with Ansible, included with your Red Hat Enterprise Linux entitlement.",
  "rhsm": "Red Hat Subscription Manager",
  "registerRhsm": "Register with RHSM",
  "registerRhsmText": "You must register all Red Hat Enterprise Linux (RHEL) systems with Red Hat Subscription Manager to recieve necessary updates and to resolve software dependencies.",
  "registerRhsmTextNote": "Note: If the system cannot be subscribed to RHSM, {basicAuth} can be configured on the client.",
  "registerRhsmTextNoteAfter": "If you have a web-based proxy between your system and the Internet, you can configure the insights-client to connect through it. For more information, refer to {howToAccess}.",
  "basicAuth": "basic authentication",
  "howToAccess": "How to access Red Hat Insights through a firewall/Proxy",
  "rhs": "Red Hat Satellite",
  "publicCloud": "Public cloud/RHUI",
  "dataCollection": "Data collection & controls",
  "learnMore": "Learn more",
  "setupConfigure": "Setup and Configure",
  "assessAndMonitor": "Assess and monitor the compliance of your RHEL systems using Policies",
  "detectAndNotify": "Detect and be notified of system configuration changes using Custom Policies",
  "rhSM": "Red Hat® Smart Management",
  "combineTheFlexible": "Combines the flexible and powerful infrastructure management capabilities of Red Hat Satellite with the ability to execute remediation plans from Red Hat Insights",
  "subscribeSatellite": "Subscribe hosts to the Satellite server",
  "subscribeSatelliteBody": "This step is typically already performed as par of Satellite host configuration.  Only RHEL hosts registered to the particular Satellite server will have reports available in the Satellite UI.",
  "verifySatellite": "Verify Satellite server connection to Red Hat Insights",
  "verifySatelliteStepOne": "In the Satellite UI, navigate to Insighst > Manage.",
  "verifySatelliteStepTwo": "Verify under Insights Engine Connection that the status is Connected and the Account Number field displays the correct information for your organization.",
  "verifySatelliteNote": "Satellite organization with Red Hat Insights must be operating in Connected mode. Any firewalls or proxies through which the Satellite server communicates to Red Hat must allow https communications to {link}.",
  "useAutomation": "Do you wish to use automation for installation?",
  "automationNote": "Note: You can automate the installation and registration of systems with Ansible, included with your Red Hat Enterprise Linux entitlement.",
  "ansible": "Ansible",
  "puppet": "Puppet",
  "no": "No"
}